[
    {
        "body": "",
        "comments": [
            {
                "body": "\"have you had a chance to try the tatcha rice enzyme powder cleanser?\"\n\"ma'am, it has a pH of 9.\"\n\ndo they think this is a game"
            },
            {
                "body": "RIGHT?! I was in Sephora the other day when they were shilling the Clinique Moisture Surge Extended Thirst Relief and one of the MUAs asked me if I use a moisturizer. PUH-lease. My moisturizer uses a moisturizer and THAT moisturizer uses a moisturizer."
            }
        ],
        "comms_num": 461,
        "created": 1490674076.0,
        "id": "61uljr",
        "score": 6617,
        "title": "[FLUFF] When I walk into Sephora and the sales associate tries to show me their new K-beauty endcap",
        "url": "https://i.redd.it/tvtt06d7c0oy.jpg"
    },
    {
        "body": "",
        "comments": [
            {
                "body": "Hello everyone coming from /r/all! \n\n/r/AsianBeauty is a sub for beauty brands and cosmetics based in Asia, make sure to read our **[RULES](https://www.reddit.com/r/AsianBeauty/wiki/rules)** before you post. All comments breaking our community guidelines will be removed!"
            },
            {
                "body": "Can you give us her skincare routine??? Seriously, I'd love to know what she does to have skin like that! Bathe in mermaid's tears every full moon? Make daily prayers to Snesus? "
            }
        ],
        "comms_num": 260,
        "created": 1488881809.0,
        "id": "5xxpix",
        "score": 5110,
        "title": "[Fluff] My mom is 65. She's the reason I wear sunscreen every day!",
        "url": "http://i.imgur.com/Bf6awEF.jpg"
    },
    {
        "body": "",
        "comments": [
            {
                "body": "Especially considering that Innisfree tries to market itself as the more \\~ecofriendly\\~ K-beauty brand... yeah it does bug me."
            },
            {
                "body": "The most annoying thing is the waste of plastic."
            }
        ],
        "comms_num": 233,
        "created": 1556851875.0,
        "id": "bjylur",
        "score": 4051,
        "title": "[Discussion] Is anyone else bothered by deceptive packaging like this?",
        "url": "https://i.redd.it/6ir9t94rguv21.jpg"
    },
    {
        "body": "",
        "comments": [
            {
                "body": "Lately I've been seeing a lot of questions about the differences between Hada Labo lotions and which lotion is which. It's especially confusing because it seems like there's 2-4 versions of each product (not including the nearly identical milk/emulsion products!) and because of the product names; for example, the main Hada Labo Gokujyun Lotion will have a dozen names that differs by each retailer because of minor translation issues. \n\nI've also seen some misinformation here on /r/AsianBeauty about these lotions, on a [guide](https://btyaly.com/articles/is-hada-labo-lotion-the-best-hyaluronic-acid-product-on-the-market/) that's been shared on this sub a few times, and on Hada Labo's USA website as well. For example:\n\n* The Hada Labo USA's website looks like it is outdated. The Alpha line has been reformulated in 2013 but the website still shows the old ingredients, the Gokujyun line still shows pictures of the old packaging, the new Shirojyun Premium products aren't listed on the website, etc.\n* [This article](https://btyaly.com/articles/is-hada-labo-lotion-the-best-hyaluronic-acid-product-on-the-market/) that's been shared a few times here lists 3 of the Shirojyun lotions but is missing the 4th, says that the Gokjyun Moist Lotion and Light Lotion both have 4 HAs but they actually have 3, says the Alpha lotion has retinyl palmitate but it doesn't since the reformulation in 2013, only lists 1 Alpha lotion when there are actually 2, etc.\n\nSo these inaccuracies prompted me to do some DEEP digging between Hada Labo's official Japanese website, numerous reddit posts and comments, beauty blogs, Cosdna ingredients lists, RatzillaCosme, Dokodemo, Kirei Station, Rakuten, etc. Between all of these sources, I tried to make a guide for all the current* Hada Labo lotions that includes their name, alternative names, notable ingredients, basic descriptions, images, recommended for which skin types, how to identify/differentiate the products, etc.\n\nTo my knowledge, this is the most accurate guide as it heavily relies on Hada Labo's official Japanese website. But please let me know if you spot any errors (and please forgive me if there are  ╥﹏╥)!!\n\nHopefully this is helpful to a lot of people and makes shopping a bit easier! \n\n(*When I say \"current\" I mean that the Hada Labo Japanese website currently lists them on their product page so presumably they're still being produced and sold.)\n\n-----\n\n**Edit:** It turns out in Asian markets, Job's tears can be sold as \"pearl barley\" or \"Chinese pearl barley\". And in America, if something is sold as \"pearl barley\", it's actual barley. So be aware of this if you are shopping specifically for barley products or Job's tears products.\n\n**Edit 2:** This guide is based on Hada Labo Japan and which products they are currently selling. It may not align with HL Singapore, HL Malaysia, HL Thailand, HL Vietnam, HL China, HL Taiwan, or HL Indonesia. These HL branches may have other product lines like the AHA+BHA line, the Kouji line, the Blemish & Oil Control line, the Pro Anti Aging line, the Advanced Nourish line, the Perfect White line, the Perfect White Supreme line, etc."
            },
            {
                "body": "I wish I could upvote this a thousand times"
            }
        ],
        "comms_num": 149,
        "created": 1573149024.0,
        "id": "dsvkvt",
        "score": 3464,
        "title": "[Guide] A Guide to Hada Labo Lotions",
        "url": "https://imgur.com/KNiJV2g"
    },
    {
        "body": "",
        "comments": [
            {
                "body": "LOL you look so fluffy!\n\nHow exactly does it feel though? I imagine it feels super soft like a puffy foaming cleanser."
            },
            {
                "body": "i want this soooooooo bad."
            }
        ],
        "comms_num": 123,
        "created": 1441624255.0,
        "id": "3jxgti",
        "score": 3449,
        "title": "1st time Bubble Clay mask, laughed so hard at myself that I cried",
        "url": "http://i.imgur.com/0GYeWwA.png"
    }
]